RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6700/HPM6750/HPM6750_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="TRGM0">
      <name>TRGM1</name>
      <description>TRGM1</description>
      <groupName>TRGM</groupName>
      <baseAddress>0xf021c000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TRGM0">
      <name>TRGM2</name>
      <description>TRGM2</description>
      <groupName>TRGM</groupName>
      <baseAddress>0xf022c000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TRGM0">
      <name>TRGM3</name>
      <description>TRGM3</description>
      <groupName>TRGM</groupName>
      <baseAddress>0xf023c000</baseAddress>
    </peripheral>
    <peripheral>
      <name>SYNT</name>
      <description>SYNT</description>
      <groupName>SYNT</groupName>
      <baseAddress>0xf0240000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>gcr</name>
          <description>Global control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CRST</name>
              <description>1- Reset counter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEN</name>
              <description>1- Enable counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>rld</name>
          <description>Counter reload register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RLD</name>
              <description>counter reload value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cnt</name>
          <description>Counter</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CMP[%s]</name>
          <description>no description available</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>comparator value, the output will assert when counter count to this value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LCDC</name>
      <description>LCDC</description>
      <groupName>LCDC</groupName>
      <baseAddress>0xf1000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x404</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFF0001F</resetMask>
          <fields>
            <field>
              <name>SW_RST</name>
              <description>Software reset, high active. When write 1 ,all internal logical will be reset.
0b - No action
1b - All LCDC internal registers are forced into their reset state. Interface registers are not affected.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISP_ON</name>
              <description>Display panel On/Off mode.
0b - Display Off.
1b - Display On.
Display can be set off at any time, but it can only be set on after VS_BLANK status is asserted.
So a good procedure to stop and turn on the display is:
1) clr VS_BLANK status
2) assert software reset
3) de-assert software reset
4) set display off
5) check VS_BLANK status until it is asserted,
6)reset the module, change settings
7) set display on</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINE_PATTERN</name>
              <description>LCDIF line output order.
000b - RGB.
001b - RBG.
010b - GBR.
011b - GRB.
100b - BRG.
101b - BGR.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISP_MODE</name>
              <description>LCDIF operating mode.
00b - Normal mode. Panel content controlled by layer configuration.
01b - Test Mode1.(BGND Color Display)
10b - Test Mode2.(Column Color Bar)
11b - Test Mode3.(Row Color Bar)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGDCL4CLR</name>
              <description>background color for clear mode when the alpha channel is 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARQOS</name>
              <description>ARQOS for bus fabric arbitration</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_PXDATA</name>
              <description>Indicates if value at the output (pixel data output) needs to be negated.
0b - Output is to remain same as the data inside memory
1b - Output to be negated from the data inside memory</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_PXCLK</name>
              <description>Polarity change of Pixel Clock.
0b - LCDC outputs data on the rising edge, and Display samples data on the falling edge
1b - LCDC outputs data on the falling edge, Display samples data on the rising edge</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_HREF</name>
              <description>Polarity of HREF
0b - HREF signal active HIGH, indicating active pixel data
1b - HREF signal active LOW</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_VSYNC</name>
              <description>Polarity of VSYNC
0b - VSYNC signal active HIGH
1b - VSYNC signal active LOW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_HSYNC</name>
              <description>Polarity of HSYNC
0b - HSYNC signal active HIGH
1b - HSYNC signal active LOW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BGND_CL</name>
          <description>Background Color Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>R</name>
              <description>Red component of the default color displayed in the sectors where no layer is active.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>G</name>
              <description>Green component of the default color displayed in the sectors where no layer is active.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B</name>
              <description>Blue component of the default color displayed in the sectors where no layer is active.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DISP_WN_SIZE</name>
          <description>Display Window Size Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Y</name>
              <description>Sets the display size vertical resolution in pixels.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X</name>
              <description>Sets the display size horizontal resolution in pixels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HSYNC_PARA</name>
          <description>HSYNC Config Register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FP</name>
              <description>HSYNC front-porch pulse width (in pixel clock cycles). If zero, indicates no front-porch for HSYNC</description>
              <bitOffset>22</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BP</name>
              <description>HSYNC back-porch pulse width (in pixel clock cycles). If zero, indicates no back-porch for HSYNC</description>
              <bitOffset>11</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PW</name>
              <description>HSYNC active pulse width (in pixel clock cycles). Pulse width has a minimum value of 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VSYNC_PARA</name>
          <description>VSYNC Config Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FP</name>
              <description>VSYNC front-porch pulse width (in horizontal line cycles). If zero, means no front-porch for VSYNC</description>
              <bitOffset>22</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BP</name>
              <description>VSYNC back-porch pulse width (in horizontal line cycles). If zero, means no back-porch for VSYNC</description>
              <bitOffset>11</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PW</name>
              <description>VSYNC active pulse width (in horizontal line cycles). Pulse width has a minimum value of 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_ST</name>
          <description>DMA Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>DMA_ERR</name>
              <description>plane n axi error. W1C.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA1_DONE</name>
              <description>Plane n frame 1 dma done. W1C.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA0_DONE</name>
              <description>Plane n frame 0 dma done. W1C.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST</name>
          <description>Status Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>URGENT_UNDERRUN</name>
              <description>Asserted when the output buffer urgent underrun condition encountered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VS_BLANK</name>
              <description>Asserted when in vertical blanking period. At the start of VSYNC</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UNDERRUN</name>
              <description>Asserted when the output buffer underrun condition encountered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VSYNC</name>
              <description>Asserted when in  vertical blanking period. At the end of VSYNC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EN</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF0F</resetMask>
          <fields>
            <field>
              <name>DMA_ERR</name>
              <description>Interrupt enable for DMA error</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_DONE</name>
              <description>Interrupt enable for DMA done</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>URGENT_UNDERRUN</name>
              <description>Asserted when the output buffer urgent underrun condition encountered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BLANK</name>
              <description>Interrupt enable for start of sof</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDERRUN</name>
              <description>Interrupt enable for underrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSYNC</name>
              <description>Interrupt enable for end of sof</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFO</name>
          <description>TX FIFO Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>THRSH</name>
              <description>Threshold to start the lcd raster (0--0x7F)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
