RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6700/HPM6750/HPM6750_svd.xml
        <register>
          <name>PKTDST</name>
          <description>Packet Memory Destination Address</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTDST</name>
              <description>Packet Memory Destination Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUF</name>
          <description>Packet buffer size.</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTBUF</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FEMC</name>
      <description>FEMC</description>
      <groupName>FEMC</groupName>
      <baseAddress>0xf3050000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x154</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFF0007</resetMask>
          <fields>
            <field>
              <name>BTO</name>
              <description>Bus timeout cycles
AXI Bus timeout cycle is as following (255*(2^BTO)):
00000b - 255*1
00001-11110b - 255*2 - 255*2^30
11111b - 255*2^31</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTO</name>
              <description>Command Execution timeout cycles
When Command Execution time exceed this timeout cycles, IPCMDERR or AXICMDERR interrupt is
generated. When CTO is set to zero, timeout cycle is 256*1024 cycle. otherwisee timeout cycle is
CTO*1024 cycle.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DQS</name>
              <description>DQS (read strobe) mode
0b - Dummy read strobe loopbacked internally
1b - Dummy read strobe loopbacked from DQS pad</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS</name>
              <description>Module Disable
0b - Module enabled
1b - Module disabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST</name>
              <description>Software Reset
Reset all internal logic in SEMC except configuration register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCTRL</name>
          <description>IO Mux Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000F0</resetMask>
          <fields>
            <field>
              <name>IO_CSX</name>
              <description>IO_CSX output selection
0001b - SDRAM CS1
0110b - SRAM CE#</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMW0</name>
          <description>Bus (AXI) Weight Control Register 0</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>RWS</name>
              <description>Weight of slave hit with Read/Write Switch. This weight score is valid when queue command's slave is
same as current executing command with read/write operation switch.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SH</name>
              <description>Weight of Slave Hit without read/write switch. This weight score is valid when queue command's slave is
same as current executing command without read/write operation switch.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGE</name>
              <description>Weight of AGE calculation. Each command in queue has an age signal to indicate its wait period. It is
multiplied by WAGE to get weight score.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QOS</name>
              <description>Weight of QOS calculation. AXI bus access has AxQOS signal set, which is used as a priority indicator
for the associated write or read transaction. A higher value indicates a higher priority transaction. AxQOS
is multiplied by WQOS to get weight score.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMW1</name>
          <description>Bus (AXI) Weight Control Register 1</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BR</name>
              <description>Weight of Bank Rotation. This weight score is valid when queue command's bank is not same as current
executing command.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS</name>
              <description>Weight of slave hit with Read/Write Switch. This weight score is valid when queue command's slave is
same as current executing command with read/write operation switch.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH</name>
              <description>Weight of Slave Hit without read/write switch. This weight score is valid when queue command's slave is
same as current executing command without read/write operation switch.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGE</name>
              <description>Weight of AGE calculation. Each command in queue has an age signal to indicate its wait period. It is
multiplied by WAGE to get weight score.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QOS</name>
              <description>Weight of QOS calculation. AXI bus access has AxQOS signal set, which is used as a priority indicator
for the associated write or read transaction. A higher value indicates a higher priority transaction. AxQOS
is multiplied by WQOS to get weight score.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>BASE0,BASE1,rsv2,rsv3,rsv4,rsv5,BASE6</dimIndex>
          <name>BR[%s]</name>
          <description>no description available</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFF03F</resetMask>
          <fields>
            <field>
              <name>BASE</name>
              <description>Base Address
This field determines high position 20 bits of SoC level Base Address. SoC level Base Address low
position 12 bits are all zero.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIZE</name>
              <description>Memory size
00000b - 4KB
00001b - 8KB
00010b - 16KB
00011b - 32KB
00100b - 64KB
00101b - 128KB
00110b - 256KB
00111b - 512KB
01000b - 1MB
01001b - 2MB
01010b - 4MB
01011b - 8MB
01100b - 16MB
01101b - 32MB
01110b - 64MB
01111b - 128MB
10000b - 256MB
10001b - 512MB
10010b - 1GB
10011b - 2GB
10100-11111b - 4GB</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLD</name>
              <description>Valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>AXIBUSERR</name>
              <description>AXI BUS error interrupt enable
0b - Interrupt is disabled
1b - Interrupt is enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXICMDERR</name>
              <description>AXI command error interrupt enable
0b - Interrupt is disabled
1b - Interrupt is enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPCMDERR</name>
              <description>IP command error interrupt enable
0b - Interrupt is disabled
1b - Interrupt is enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPCMDDONE</name>
              <description>IP command done interrupt enable
0b - Interrupt is disabled
1b - Interrupt is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>AXIBUSERR</name>
              <description>AXI bus error interrupt
AXI Bus error interrupt is generated in following cases:
• AXI address is invalid
• AXI 8-bit or 16-bit WRAP write/read</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXICMDERR</name>
              <description>AXI command error interrupt
AXI command error interrupt is generated when AXI command execution timeout.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IPCMDERR</name>
              <description>IP command error done interrupt
IP command error interrupt is generated in following case:
• IP Command Address target invalid device space
• IP Command Code unsupported
• IP Command triggered when previous command</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IPCMDDONE</name>
              <description>IP command normal done interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRCTRL0</name>
          <description>SDRAM Control Register 0</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00004FFB</resetMask>
          <fields>
            <field>
              <name>BANK2</name>
              <description>2 Bank selection bit
0b - SDRAM device has 4 banks.
1b - SDRAM device has 2 banks.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAS</name>
              <description>CAS Latency
00b - 1
01b - 1
10b - 2
11b - 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COL</name>
              <description>Column address bit number
00b - 12 bit
01b - 11 bit
10b - 10 bit
11b - 9 bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COL8</name>
              <description>Column 8 selection bit
0b - Column address bit number is decided by COL field.
1b - Column address bit number is 8. COL field is ignored.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BURSTLEN</name>
              <description>Burst Length
000b - 1
001b - 2
010b - 4
011b - 8
100b - 8
101b - 8
110b - 8
111b - 8</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGHBAND</name>
              <description>high band select
0: use data[15:0] for 16bit SDRAM;
1: use data[31:16] for 16bit SDRAM;
only used when Port Size is 16bit(PORTSZ=01b)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTSZ</name>
              <description>Port Size
00b - 8bit
01b - 16bit
10b - 32bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRCTRL1</name>
          <description>SDRAM Control Register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>ACT2PRE</name>
              <description>ACT to Precharge minimum time
It is promised ACT2PRE+1 clock cycles delay between ACTIVE command to PRECHARGE/PRECHARGE_ALL command.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEOFF</name>
              <description>CKE OFF minimum time
It is promised clock suspend last at leat CKEOFF+1 clock cycles.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRC</name>
              <description>Write recovery time
It is promised WRC+1 clock cycles delay between WRITE command to PRECHARGE/PRECHARGE_ALL command. This could help to meet tWR timing requirement by SDRAM device.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFRC</name>
              <description>Refresh recovery time
It is promised RFRC+1 clock cycles delay between REFRESH command to ACTIVE command. Thiscould help to meet tRFC timing requirement by SDRAM device.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACT2RW</name>
              <description>ACT to Read/Write wait time
It is promised ACT2RW+1 clock cycles delay between ACTIVE command to READ/WRITE command.This could help to meet tRCD timing requirement by SDRAM device.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE2ACT</name>
              <description>PRECHARGE to ACT/Refresh wait time
It is promised PRE2ACT+1 clock cycles delay between PRECHARGE/PRECHARGE_ALL commandto ACTIVE/REFRESH command. This could help to meet tRP timing requirement by SDRAM device.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRCTRL2</name>
          <description>SDRAM Control Register 2</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITO</name>
              <description>SDRAM Idle timeout
It closes all opened pages if the SDRAM idle time lasts more than idle timeout period. SDRAM is
considered idle when there is no AXI Bus transfer and no SDRAM command pending.
00000000b - IDLE timeout period is 256*Prescale period.
00000001-11111111b - IDLE timeout period is ITO*Prescale period.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACT2ACT</name>
              <description>ACT to ACT wait time
It is promised ACT2ACT+1 clock cycles delay between ACTIVE command to ACTIVE command. This
could help to meet tRRD timing requirement by SDRAM device.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF2REF</name>
              <description>Refresh to Refresh wait time
It is promised REF2REF+1 clock cycles delay between REFRESH command to REFRESH command.
This could help to meet tRFC timing requirement by SDRAM device.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRRC</name>
              <description>Self Refresh Recovery time
It is promised SRRC+1 clock cycles delay between Self-REFRESH command to any command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRCTRL3</name>
          <description>SDRAM Control Register 3</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF0F</resetMask>
          <fields>
            <field>
              <name>UT</name>
              <description>Refresh urgent threshold
Internal refresh request is generated on every Refresh period. Before internal request timer count up to
urgent request threshold, the refresh request is considered as normal refresh request. Normal refresh
request is handled in lower priority than any pending AXI command or IP command to SDRAM device.
When internal request timer count up to this urgent threshold, refresh request is considered as urgent
refresh request. Urgent refresh request is handled in higher priority than any pending AXI command or IP
command to SDRAM device.
NOTE: When urgent threshold is no less than refresh period, refresh request is always considered as
urgent refresh request.
Refresh urgent threshold is as follwoing:
00000000b - 256*Prescaler period
00000001-11111111b - UT*Prescaler period</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT</name>
              <description>Refresh timer period
Refresh timer period is as following:
00000000b - 256*Prescaler period
00000001-11111111b - RT*Prescaler period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESCALE</name>
              <description>Prescaler timer period
Prescaler timer period is as following:
00000000b - 256*16 clock cycles
00000001-11111111b - PRESCALE*16 clock cycles</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REBL</name>
              <description>Refresh burst length
It could send multiple Auto-Refresh command in one burst when REBL is set to non-zero. The
number of Auto-Refresh command cycle sent to all SDRAM device in one refresh period is as following.
000b - 1
001b - 2
010b - 3
011b - 4
100b - 5
101b - 6
110b - 7
111b - 8</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REN</name>
              <description>Refresh enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
